Iteration_4_bckup/app/controllers/participants_controller.rb

  def create
    @participant = Participant.new(participant_params)
    print("hello\n")
    print(@participant.user_id)
    print("hello")
    if @participant.save
---
INSERT INTO "participants" ("name", "major", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Richard"], ["major", "ECE"], ["user_id", 2], ["created_at", 2017-04-28 23:11:07 UTC], ["updated_at", 2017-04-28 23:11:07 UTC]]