Iteration_4_bckup/app/controllers/votes_controller.rb

  def create
    if params[:poll] && params[:poll][:id] && params[:vote_option] && params[:vote_option][:id]
      @poll = Poll.find_by_id(params[:poll][:id])
      @option = @poll.vote_options.find_by_id(params[:vote_option][:id])
      respond_to do |format|
        if @option && @poll
          @option.votes.create()
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "vote_options".* FROM "vote_options" WHERE "vote_options"."poll_id" = ? AND "vote_options"."id" = ? LIMIT ?  [["poll_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("vote_option_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["vote_option_id", 1], ["created_at", 2017-04-26 03:56:54 UTC], ["updated_at", 2017-04-26 03:56:54 UTC]]