demo/app/controllers/participants_controller.rb

INSERT INTO "participants" ("name", "major", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Richard"], ["major", "ECE"], ["user_id", 2], ["created_at", 2017-04-28 23:11:07 UTC], ["updated_at", 2017-04-28 23:11:07 UTC]]
---
  def create
    session[:flag]=1
    @participant = Participant.new(participant_params)
    if @participant.save